package org.jazzteam.utility;

public class Constants {
    public static final String[] UNITS = {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    public static final String[] REJECTED_UNITS = {"одна", "две", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    public static final String[] NUMBER_FROM_11_TO_19 = {"одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    public static final String[] DOZENS = {"десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    public static final String[] HUNDREDS = {"сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};

    public static final String[][] DECLINATIONS = {
            {"", "", ""},
            {"тысяча", "тысячи", "тысяч"},
            {"миллион", "миллиона", "миллионов"},
            {"миллиард", "миллиарда", "миллиардов"},
            {"триллион", "триллиона", "триллионов"},
//            You can uncomment if you are gonna use numbers over trillions
//            {"квадриллион", "квадриллиона", "квадриллионов"},
//            {"квинтиллион", "квинтиллиона", "квинтиллионов"},
    };
}
